Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འཇིག་རྟེན་མགོན་པོ་སྒྲ་གཅན་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ལྷ་མིན་མཆོད་རྟེན་ཞེས་ཀྱང་བྱ། །
en: The protector of the world Rāhu will be born in a place Called Stūpa for Demigods.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ལྷ་དབང་ཡིན། །ལྷ་མ་ཡིན་དབང་བདག་མོ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend twenty-two leagues. Divine King will be his father, and Lady Who Rules the Demigods will be this victor’s mother.

source: སྲས་པོ་ནོར་ལྡན་ནོར་བཟངས་རིམ་གྲོ་པ། །
en: Endowed with Wealth will be his son and Excellent Wealth his attendant.

source: དུལ་གནས་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joy in Abiding by the Training will be the scholar

source: དགྲ་ཡིས་འཇིགས་པ་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Free from the Fear of Enemies the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གཉིས་ཀུན་ལ་ཡང་། །སྲེད་པ་འགོག་པར་ཐར་ལ་དགའ་བ་པོ། །ཐེར་འབུམ་ཕྲག་ནི་གསུམ་གསུམ་ཡོད་པར་འགྱུར། །
en: There will be twelve consecutive congregations, Each of them gathering three billion “Who delight in liberation through the cessation of craving.

source: སྲིད་མཐར་ཕྱིན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: And after the one who has reached the end of existence has attained nirvāṇa His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྲིད་པ་གསུམ་པོར་མཆོད་ཅིང་བཀུར་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Worshiped and venerated throughout the three realms.

source: དེ་བཞིན་གཤེགས་པ་བདུད་རྩི་འོད་སྐྱེ་བའི། །ཡུལ་ནི་ཡོན་ཏན་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Amṛtaprabha will be born In a place called Illuminating Qualities.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །དད་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend three leagues. Powerful will be his father, and Endowed with Faith will be this victor’s mother.

source: སྲས་པོ་གོ་བགོས་དུལ་བ་རིམ་གྲོ་པ། །
en: Donning the Armor will be his son and Training his attendant.

source: བདུད་རྩིའི་ང་རོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Nectar Roar will be the scholar

source: བསམ་གཏན་པ་ལ་དད་བྱེད་རྫུ་འཕྲུལ་ཅན། །
en: And Instilling Faith in Meditators the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཉོན་མོངས་བདུད་ཀུན་འཇོམས་པར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be sixty-six consecutive congregations, Each of them gathering seven hundred twenty million “Vanquishers of all the māra-defilements.

source: དམ་ཆོས་ལོ་གྲངས་དྲུག་ཁྲི་དྲུག་སྟོང་གནས། །
en: And the sacred Dharma will remain for sixty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཅུ་གཉིས་གསེར་གྱི་བླ་རེར་ལྡན། །རིན་ཆེན་མཆོག་གི་རྣ་རྒྱན་དག་གིས་བརྒྱན། །
en: The relics of this victor will reside in a single stūpa “Twelve leagues large, shielded by golden canopies, And adorned with ear ornaments of supreme jewels.

source: བདེ་གཤེགས་འཇིག་རྟེན་མཆོག་མ་སྐྱེ་བའི་ཡུལ། །ཤིན་ཏུ་སྙན་པའི་གཏམ་དང་ལྡན་ཞེས་བྱ། །
en: The well-gone Lokajyeṣṭha will be born In a place called Endowed with Extremely Delightful Words.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གསུམ་མེ་ཏོག་བཟང་པོ་ཡབ། །དཔལ་རྒྱལ་མེ་ཏོག་ཡུམ་ཡིན་མེ་ཏོག་གསལ། །སྲས་ཡིན་ཙམ་པ་ཀ་ནི་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-three leagues. Excellent Flower will be his father, and Flower of Royal Glory will be this victor’s mother. Luminous Flower will be his son and Campaka his attendant.

source: མེ་ཏོག་སྡུག་ཅེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Endearing Flower will be the scholar

source: འཇིགས་མེད་མེ་ཏོག་ཅེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Flower of Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལའང་། །ཆགས་ལས་འདས་པ་འཇིག་རྟེན་མི་ལྟ་བ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: There will be twenty-six consecutive congregations, Each of them gathering two hundred thirty million “Who have gone beyond attachment and have no concern about the world.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་ལྔ་སྟོང་ཡིན། །
en: The lifespan of humans will be twenty-five thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་མུ་ཏིག་བླ་རེར་བཅས། །བཻ་དཱུརྱ་ཡི་རྣ་རྒྱན་བརྩེགས་པར་ལྡན། །
en: The relics of this victor will reside in a single stūpa “Four leagues large, shielded by canopies of pearl, And adorned with beryl ear ornaments.

source: དེ་བཞིན་གཤེགས་པ་སྐར་མའི་འོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འོད་འཕྲོ་ཅན་ཞེས་བྱ། །
en: The thus-gone Jyotiṣprabha will be born In a place called Radiant Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་སྣང་བའི་དབང་པོ་ཡབ། །འོད་འཕྲོ་སྣང་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty leagues. Master of Light will be his father, and Shining Light will be this victor’s mother.

source: སྲས་པོ་མེད་བྱིན་འོད་ལྡན་རིམ་གྲོ་པ། །
en: Fire Gift will be his son and Radiant his attendant.

source: གློག་འོད་གཟི་བརྗིད་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Flashing Splendor will be the one of intelligence

source: འོད་འཕྲོ་གསལ་བའི་དཔལ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Glory of Radiant Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་ཀུན་ལ་ཡང་། །ཆུ་བོ་བཞི་ཡི་ཕ་མཐར་ལེགས་གནས་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་ལྔ་ལྔ་ཡོད། །
en: There will be sixty consecutive congregations, Each of them gathering two hundred fifty million “Who abide on the far side of the four rivers.

source: ཡོན་ཏན་སློབ་དཔོན་དག་གི་དམ་ཆོས་དག ། ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of this master of excellent qualities Will remain for thirty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཚན་མོ་མར་མེ་སྟོང་སྙེད་འོད་ཀྱང་འབར། །
en: “The relics of this victor will be abundant And at night illuminated by thousands of butter lamps.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བའི་སྟོབས་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་མཁས་པས་མཆོད་ཅེས་བྱ། །
en: The thus-gone Śāntagati will be born In a place called Worshiped by the Learned.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བདུན་ཡབ་ནི་རྣམ་གྲོལ་ཡིན། །དགྲ་བཅོམ་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-seven leagues. Liberation will be his father, and Joy of the Worthy will be this victor’s mother.

source: སྲས་པོ་འཆད་མཁན་དགེ་ལེགས་རིམ་གྲོ་པ། །
en: Teacher will be his son and Excellent Virtue his attendant.

source: མཆོད་རྟེན་ཆེན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Great Stūpa will be the one of intelligence

source: རྒོལ་བས་འཇིགས་པ་མེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And No Fear of Attack the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །འཇིག་རྟེན་ཟང་ཟིང་མེད་པའི་དགྲ་བཅོམ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གསུམ་གསུམ་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering two hundred thirty million “Worthy ones free from the business of the world.

source: དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲི་ཆིག་སྟོང་གནས། །
en: And the sacred Dharma will remain for thirty-one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཞི་པ་རིན་ཆེན་ཕལ་པོ་ཆེའི། །དྲ་བས་སྤྲས་པས་འོད་ནི་མཐའ་ཡང་ཡས། །
en: The relics of this victor will reside in a single stūpa “Four leagues large and adorned with nets of great jewels That blaze with infinite light.

source: དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་རྒྱ་མཚོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་ཚོགས་ཞེས་བྱ། །
en: The thus-gone Jñānasāgara will be born In a place called Gathering of Wisdom.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གསུམ་ཡབ་ནི་ཡོན་ཏན་ཡིན། །དོན་འདོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend thirty-three leagues. Qualities will be his father, and Meaningful Wish will be this victor’s mother.

source: སྲས་པོ་ལེགས་གཞི་ཟླ་དབང་རིམ་གྲོ་པ། །
en: Excellent Peace will be his son and Moon Ruler his attendant.

source: མཆོད་རྟེན་ཤིང་རྟ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Stūpa Chariot will be the scholar

source: འཇིགས་མེད་ཡེ་ཤེས་ལྡན་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Endowed with Fearless Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །སྲེད་པའི་རྒྱ་མཚོ་རྣམ་པར་སྐེམས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གསུམ་གསུམ་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering seven hundred thirty million “Who have dried up the ocean of craving.

source: རྒྱལ་བ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །འོན་ཀྱང་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: And after this victor has attained nirvāṇa His sacred Dharma will still remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ཞིང་རྣམས་ཀུན་ཏུ་འོད་ནི་མཐའ་ཡང་ཡས། །
en: “The relics of this victor will be abundant, Filling the realms with infinite light.

source: ཆོས་ཀྱི་དབང་ཕྱུག་རི་ཡི་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མཛེས་པར་སྤྲས་ཞེས་བྱ། །
en: The Dharma lord, Parvatendra, will be born In a place called Beautifully Decorated.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ལྷ་ཡི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ten leagues. Divine Excellence will be his father, and Divine Lady will be this victor’s mother.

source: སྲས་པོ་ཙན་དན་སྤོས་བཟངས་རིམ་གྲོ་པ། །
en: Sandalwood will be his son and Excellent Fragrance his attendant.

source: རིན་ཆེན་འགྲོས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Jewel Mode will be the scholar

source: ཆོས་ལ་རྣམ་པར་ལྟ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Viewing the Dharma the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཆགས་པ་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering two hundred twenty million “Worthy ones who are free from attachment.

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །
en: And for the benefit of wandering beings the sacred Dharma

source: ལོ་གྲངས་སུམ་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: Will remain for thirty-four thousand years.

source: སྐུ་གདུང་རྒྱས་འགྱུར་མཆོད་རྟེན་དམ་པའི་གྲངས། །བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུ་རྩ་གཉིས་འབྱུང་། །
en: “The relics of this victor will be abundant, And the fine stūpas will number two hundred twenty billion.

source: མི་ཡི་མགོན་པོ་རབ་ཏུ་ཞི་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གྲགས་པར་སྣང་ཞེས་བྱ། །
en: The protector of humanity, Praśānta, will be born In a place called Renowned Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཤིན་ཏུ་ཞི་བ་ཡབ། །ཞི་གནས་དགའ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Perfect Peace will be his father, and Joyful Calm Abiding will be this victor’s mother.

source: སྲས་པོ་ཞི་བྱིན་ཞི་དབང་རིམ་གྲོ་པ། །
en: Giver of Peace will be his son and Master of Peace his attendant.

source: བདུད་བཞི་བྱེད་པ་བློ་གྲོས་ཅན་ཡིན་ཏེཡིད་དབང་ཤིན་ཏུ་ཞི་བ་རྫུ་འཕྲུལ་ཅན། །
en: “Pacifier of the Māras will be the one of intelligence And Serene Mental Faculties the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་དྲུག་ཀུན་ལ་ཡང་། །སྲིད་པར་འཛིན་པའི་མདུད་པ་རྣམ་གྲོལ་བ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be sixteen consecutive congregations, Each of them gathering seven hundred twenty million “Who are free from the knots of adherence to existence.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain for twenty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །
en: “The relics of this victor will reside in a single stūpa

source: དཔག་ཚད་ལྔ་པ་རིན་ཆེན་བདུན་ལས་བྱས། །
en: Measuring five leagues and built of the seven precious substances.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་མཐུ་སྟོབས་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་ལེགས་པར་སྐྱེས་ཞེས་བྱ། །
en: The thus-gone Guṇabala will be born In a place called Excellent Birth.

source: རིགས་ནི་བྲམ་ཟེ་ཁྱད་པར་འཕགས་པའི་འོད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ལེགས་བརྩེགས་ཡིན། །ཡོན་ཏན་འོད་འཕྲོ་རྒྱལ་ཡུམ་ཡོན་ཏན་མཆོག །སྲས་ཡིན་ཡོན་ཏན་གཙོ་བོ་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his superior light will extend seventy leagues. Excellent Peak will be his father, and Luminous Qualities will be this victor’s mother. Supreme Qualities will be his son and Foremost Qualities his attendant.

source: ཡོན་ཏན་དབང་པོ་གསལ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Qualities of Clear Faculties the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཆགས་མེད་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་བཞི་བཞི་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering nine hundred forty million “Worthy ones who abide free from attachment.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །
en: And after the teacher has attained nirvāṇa his sacred Dharma

source: ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: Will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བདུན་པ་ཏོག་མཆོག་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Measuring seven leagues and adorned with supreme crests and canopies.

source: བདེ་བར་གཤེགས་པ་ལྷ་ཡི་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དབང་པོས་བརྒྱན་ཞེས་བྱ། །
en: The well-gone Deveśvara will be born In a place called Adorned with the Ruler.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་དབང་ཆེན་ཡིན། །དགེ་དབང་བློ་གྲོས་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཚིག་ལེན་ནོར་ཀུན་བཟང་པོ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend ten leagues. Great Rule will be his father, and Intelligence of Virtuous Rule will be this victor’s mother. Recollecting the Words will be his son and Excellence of Universal Wealth his attendant.

source: དབང་པོའི་རྒྱལ་མཚན་ཏོག་ནི་བློ་ཅན་ཏེ། །
en: “Crested Ruler Banner will be the one of intelligence

source: བག་ཡོད་རྣམ་པར་གྲགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Renowned Carefulness the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་གཉིས་ཀུན་ལའང་། །འཆིང་དང་དྲ་བ་འདོར་བར་བྱེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be thirty-two consecutive congregations, Each of them gathering two hundred forty million “Who discard the bonds and nets.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་གནས། །
en: And after this knower of the world has attained nirvāṇa His sacred Dharma will remain for thirty-six thousand years.

source: མཆོད་རྟེན་དཔག་ཚད་བརྒྱད་པ་འབྱུང་འགྱུར་ཏེ། །རིན་ཆེན་བརྒྱ་ཡི་དྲ་བས་རྣམ་པར་སྤྲས། །
en: “His stūpa will measure eight leagues And be decorated with nets of hundreds of jewels.

source: མི་ཡི་འདྲེན་པ་དབྱངས་དག་སྙན་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དབྱངས་ཀྱི་ཡན་ལག་ཡིན། །
en: The guide of humans, Mañjughoṣa, will be born In a place called Melody Factors.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་དབྱངས་སྙན་ཡིན། །གདངས་སྙན་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །མཆོག་མ་ཤིན་ཏུ་རྒྱལ་དཀའ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend one hundred leagues. Delightful Melody will be his father, and Delightful Tones will be this victor’s mother. Supreme will be his son and Extremely Hard to Conquer his attendant.

source: ཡོན་ཏན་གྲགས་པའི་དབང་ཕྱུག་བློ་ཅན་ཏེ། །
en: “Master of Famed Qualities will be the one of intelligence

source: འཇིག་རྟེན་དག་གིས་མི་འཇིགས་རྫུ་འཕྲུལ་ཅན། །
en: And No Fear of the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །རིགས་ནི་འོད་ལྡན་ལུང་ནི་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering nine hundred ninety million “Whose family will be illustrious, just as their teaching will be.

source: མི་མཆོག་མྱ་ངན་འདས་ནས་སྐུ་གདུང་ནི། །མཆོད་རྟེན་དཔག་ཚད་སུམ་ཅུ་པ་གཅིག་འབྱུང་། །
en: “After this supreme human has attained nirvāṇa His relics will reside in a single stūpa measuring thirty leagues.

source: དེ་བཞིན་གཤེགས་པ་ངོས་བཟངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་གཟི་བརྗིད་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Supārśva will be born In a place called Illuminating Splendor.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ལྷ་བཟང་ཡིན། །རིལ་བ་སྟོབས་བརྟན་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །དཀའ་ཐུབ་ཆེན་པོ་མཐོང་ལྡན་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Divine Excellence will be his father, and Vessel of Firm Strength will be this victor’s mother. Great Austerities will be his son and Endowed with Vision his attendant.

source: ཕྱོགས་རྣམས་རྣམ་པར་ལྟ་བ་མཁས་པ་སྟེ། །
en: “Viewing the Positions will be the scholar

source: འཇིག་རྟེན་སྒྲོན་མ་འབྱིན་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Gift of the Lamp of the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །དྲི་གསུམ་དྲི་མེད་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering one billion “Who are free from the three stains.

source: མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་སུམ་སྟོང་ཐམ་པ་ཡིན། །
en: The lifespan of humans will be seventy-three thousand years,

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲི་ཚང་བའི་བར་དུ་གནས། །
en: And after this teacher has attained parinirvāṇa His sacred Dharma will remain complete for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ལྷ་མི་དག་གིས་བསྟོད་ཅིང་མཆོད་པར་འགྱུར། །
en: “The relics of this victor will be abundant, Praised and worshiped by gods and humans.

source: མི་ཡི་འདྲེན་པ་དོན་ལ་གནས་པ་ཡི། །སྐྱེ་ཡུལ་དོན་སྟོན་བློ་གྲོས་ཞེས་ཀྱང་བྱ། །
en: The guide of humans Sthitārtha will be born In a place called Intelligence That Reveals the Meaning.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་ལྔ་ཡོད་ཡབ་ནི་དོན་བྱས་ཡིན། །དོན་སྒྲ་ཞེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend five leagues. Meaning Accomplished will be his father, and Meaningful Speech will be this victor’s mother.

source: སྲས་པོ་མཆོག་མ་འགྲོས་ལྡན་རིམ་གྲོ་པ། །
en: Supreme will be his son and Endowed with the Mode his attendant.

source: འགྲོ་དོན་སྐྱོང་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Accomplishing the Objectives of Wandering Beings will be the scholar

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ངར་མི་འཛིན་པ་སྡིག་སྦྱངས་པ། །ལེགས་གནས་དེ་དག་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering one billion worthy ones “Who abide in excellence, free from grasping an ‘I’ and with unwholesomeness purified.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་འབུམ་ཕྲག་སྙེད་ཀྱིས་བརྒྱན་པར་འགྱུར། །
en: “The relics of this victor will be abundant, Adorned with hundreds of thousands of stūpas.

source: དེ་བཞིན་གཤེགས་པ་ཡོན་ཏན་གཟི་བརྗིད་དཔལ། །སྐྱེ་ཡུལ་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་ཞེས་བྱ། །
en: The thus-gone Guṇatejas will be born In a place called Source of All Excellent Qualities.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་ཡབ་ནི་གཟུགས་བཟང་ཡིན། །གཟི་བརྗིད་འོད་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །གཟི་བྱིན་ཡོན་ཏན་གཟི་བརྗིད་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-four leagues. Excellent Form will be his father, and Splendid Light will be this victor’s mother. Splendid Gift will be his son and Qualities of Splendor his attendant.

source: ཕྱོགས་མཆོད་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Universal Worship will be the scholar

source: བདུད་རབ་འཇོམས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Defeater of the Māras the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་བྱེ་བ་བཅུ་དྲུག་བཅུ་དྲུག་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering one hundred sixty million worthy ones.

source: མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་བདུན་སྟོང་ཐམ་པ་ཡིན། །
en: “The lifespan of humans Will be twenty-seven thousand years,

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །པད་མ་འབུམ་ཕྲག་སྙེད་ཀྱིས་བརྒྱན་པར་འགྱུར། །
en: “The relics of this victor will be abundant, Adorned with hundreds of thousands of stūpas.

source: དེ་བཞིན་གཤེགས་པ་མཁྱེན་ལྡན་ཟླ་མེད་པ། །སྐྱེ་ཡུལ་ཤེས་ལྡན་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The thus-gone Anuttarajñānin will be born In a place called Illuminating Possession of Knowledge.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གསུམ་མཆོད་སྦྱིན་བཟང་པོ་ཡབ། །ཡེ་ཤེས་ཅན་ནི་རྒྱལ་ཡུམ་ཤེས་ལྡན་བྱིན། །སྲས་ཡིན་ལེགས་པའི་མཆོད་སྦྱིན་རིམ་གྲོ་པ། །
en: “His family will be brahmin, And his light will extend seventy-three leagues. Excellent Gift of Worship will be his father, and Endowed with Wisdom will be this victor’s mother. Endowed with Knowledge will be his son and Excellent Sacrifice his attendant.

source: ཡེ་ཤེས་དབང་ཕྱུག་ཅེས་བྱ་མཁས་པ་སྟེ། །
en: “Master of Wisdom will be the scholar

source: ཆགས་མེད་རྣམ་པར་གྲོལ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Liberation without Attachment the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །སྲེད་ཕྱོགས་དྲི་མ་དག་དང་བྲལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering two hundred twenty million “Who are free from the stains associated with craving.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གྲངས། །བཅུ་གསུམ་པ་སྟེ་གཅིག་ཅིག་འབྱུང་འགྱུར་ལ། །གསེར་གྱི་བླ་རེ་བརྒྱ་ཕྲག་སྙེད་ཀྱིས་བརྒྱན། །
en: The single relic of this victor will reside in a stūpa “That is thirteen leagues large And adorned with hundreds of golden canopies.

source: དེ་བཞིན་གཤེགས་པ་ང་རོ་དཔག་མེད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་རྟ་སྐད་དབྱངས་ཞེས་བྱ། །
en: The thus-gone Amitasvara will be born In a place called Melodious Neighing.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་ཉི་ཤུ་ཡབ་ནི་དབྱངས་སྙན་ཡིན། །ཤེས་ལྡན་དབྱངས་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །བྱེ་བརྒྱད་པ་ཡིན་སྙན་ལྡན་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty leagues. Delightful Melody will be his father, and Melody of Knowledge will be this victor’s mother. Eightieth Million will be his son and Melodious his attendant.

source: གདངས་སྙན་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Delightful Tones will be the scholar

source: བདུད་རྣམས་རྣམ་པར་འཇིག་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Destroyer of the Māras the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐུབ་པའི་དགྲ་བཅོམ་ཡེ་ཤེས་མཆོག་ལྡན་པ། །ཐེར་འབུམ་ཐེར་འབུམ་དག་ནི་འདུས་པར་འགྱུར། །
en: There will be eighty consecutive congregations, Each of them gathering one billion of the able one’s worthy ones “Who are endowed with supreme wisdom.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་སྟོང་ཕྲག་སྙེད་ཀྱིས་ཀུན་ཏུ་གང་། །
en: “The relics of this victor will be abundant, Residing in thousands of stūpas.

source: སྐྱེས་བུ་དམ་པ་འོད་བཟང་སྐྱེ་བ་ཡི། །ཡུལ་ནི་འོད་ཀྱིས་ལེགས་པར་བརྒྱན་ཞེས་བྱ། །
en: The holy being Sukhābha will be born In a place called Beautifully Adorned with Light.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་མཐུ་ལྡན་ཡིན། །གཟི་བརྗིད་ཆེན་མོ་ཅན་ནི་རྒྱལ་བའི་ཡུམ། །སྲས་པོ་ཚངས་སྦྱིན་ཡུལ་ས་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-two leagues. Powerful will be his father, and Possessor of Great Splendor will be this victor’s mother. Brahmā Gift will be his son and Land his attendant.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་ཀུན་ལ་ཡང་། །ཚངས་པར་སེམས་བཟང་ལྷ་ཡིས་མཆོད་འགྱུར་བ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be seventy consecutive congregations, Each of them gathering two hundred forty million “Who are worshiped by fine gods of pure mind.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འཇིག་རྟེན་ཕན་ཕྱིར་རྒྱལ་བས་རྣམ་པར་བཀང་། །
en: “The relics of this victor will be abundant, Victoriously filling the world for the benefit of its beings.

source: འཇིག་རྟེན་མཆོག་མ་ཤིན་ཏུ་ཐུགས་གཞུངས་པའི། །སྐྱེ་བའི་ཡུལ་ནི་བྱང་ཆུབ་ཚོགས་ཞེས་བྱ། །
en: The one who is supreme in the world, Sumedhas, will be born In a place called Gatherings of Awakening.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་གསལ་བ་ཡིན། །གཟི་བརྗིད་འོད་ལྡན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend nine leagues. Luminous will be his father, and Possessor of Radiant Splendor will be this victor’s mother.

source: སྲས་པོ་ཡུལ་སྡུག་ལེགས་མཐོང་རིམ་གྲོ་པ། །
en: Delightful Land will be his son and Excellent Sight his attendant.

source: མི་སྙོམས་ཏོག་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Crest of Equanimous Eyes will be the one of intelligence
